Repository: mansj/enable-media-replace
Catalog: languages/enable-media-replace-*.po
Languages: pt_pt

source: Replace media
pt_pt: Substituir media

source: Upload a new file
pt_pt: Carregar novo ficheiro

source: To replace the current file, click the link and upload a replacement.
pt_pt: Para subtituir o ficheiro actual, clique na ligação e carregue um substituto.

source: Revised
pt_pt: Revisto

source: You do not have permission to upload files.
pt_pt: Não tem permissão para carregar ficheiros.

source: Replace Media Upload
pt_pt: Carregar substituição de media

source: NOTE: You are about to replace the media file
pt_pt: NOTA: Irá substituir o ficheiro de media

source: There is no undo. Think about it!
pt_pt: Não será possível voltar a trás!

source: Choose a file to upload from your computer
pt_pt: Escolher um ficheiro para carregar a partir do computador

source: Select media replacement type:
pt_pt: Seleccione o tipo de substituição de media

source: Just replace the file
pt_pt: Apenas substituir o ficheiro

source: Note: This option requires you to upload a file of the same type (
pt_pt: Nota: Esta opção requer o carregamento de um ficheiro do mesmo tipo (

source: ) as the one you are replacing. The name of the attachment will stay the same (
pt_pt: ) daquele a substituir. O nome do ficheiro permanecerá o mesmo (

source: ) no matter what the file you upload is called.
pt_pt: ), independentemente do nome do ficheiro carregado.

source: Replace the file, use new file name and update all links
pt_pt: Substituir o ficheiro, usar o novo nome de ficheiro e actualizar todas as ligações

source: Note: If you check this option, the name and type of the file you are about to upload will replace the old file. All links pointing to the current file (
pt_pt: Nota: Se selecionar esta opção, o nome e tipo do ficheiro que está prestes a carregar irá substituir os do ficheiro antigo. Todas as ligações que referenciam o ficheiro actual (

source: ) will be updated to point to the new file name.
pt_pt: ) serão actualizadas de forma a referenciar o novo nome de ficheiro.

source: Please note that if you upload a new image, only embeds/links of the original size image will be replaced in your posts.
pt_pt: Por favor tenha em atenção que se carregar uma nova imagem, apenas as imagens incorporadas e ligações com o tamanho original serão substituídas nos seus artigos.

source: Upload
pt_pt: Carregar

source: Cancel
pt_pt: Cancelar

source: The file %1$s can not be deleted by the web server, most likely because the permissions on the file are wrong.
pt_pt: O ficheiro %1$s não pode ser apagado pelo servidor web, provavelmente porque as permissões do ficheiro estão incorrectas.

source: File type does not meet security guidelines. Try another.
pt_pt: O tipo de ficheiro não está de acordo com os padrões de segurança. Tente outro.
